Revit 2026 API

# ControlledApplicationLanguage Property

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LanguageType Language { get; }
```
```vb
Public ReadOnly Property Language As LanguageType
	Get
```
```cpp
public:
property LanguageType Language {
	LanguageType get ();
}
```
```fsharp
member Language : LanguageType with get
```

#### Property Value

LanguageType

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace